{
    "_blog main page": "Blog Main Page",
    "Blog Indo Teknik": "Indo Teknik Blog",
    "Sumber inspirasi Anda untuk pengetauhan diesel dan otomotif": "Your go-to source for diesel and automotive knowledge",
    "Selengkapnya": "Read More",

    "31/12/2024": "Posted",
    "Jaga Mesin Diesel Anda Tetap Prima dengan Pipa Common Rail Kobelco SK130!":"Keep Your Diesel Engine in Top Condition with the Kobelco SK130 Common Rail Pipe!",
    "Pipa Common Rail Kobelco SK130 dirancang dengan daya tahan tinggi dan desain yang efisien":"The Kobelco SK130 Common Rail Pipe is designed with high durability and an efficient design",

    "28/12/2024":"Posted",
    "Buka Valve Lebih Cepat dan Aman dengan Tool Injector Ford 2.2 dari Itech!":"Open Valves Faster and Safer with the Itech Tool Injector Ford 2.2!",
    "Tool Injector ini terbuat dari bahan premium yang dirancang untuk bertahan di kondisi kerja berat":"This Tool Injector is crafted from premium materials designed to withstand heavy-duty work conditions",

    "21/12/2024": "Posted",
    "Maksimalkan Performa Alat Berat Anda dengan Injection Pump CAT 320D!": "Maximize Your Heavy Equipment Performance with the CAT 320D Injection Pump!",
    "Injection Pump CAT 320D dibuat dengan material unggulan yang dirancang untuk menghadapi kondisi kerja paling ekstrem":"The CAT 320D Injection Pump is crafted from premium materials designed to withstand the toughest working conditions",

    "24/12/2024": "Posted",
    "Solenoid Handal Kinerja Optimal! Selenoid Injektor Kobelco SK200": "Reliable Solenoid for Optimal Performance! Kobelco SK200 Injector Solenoid",
    "Apakah Anda sedang mencari solenoid injektor berkualitas tinggi untuk mesin Kobelco SK200 Anda? Kami punya solusi terbaik untuk Anda!":"Are you looking for a high-quality injector solenoid for your Kobelco SK200 machine? We have the perfect solution for you!",

    "17/12/2024": "Posted",
    "Tingkatkan Performa CAT 320D Anda: Dapatkan Tenaga Maksimal dengan Injector Hebat Ini!":"Unleash Maximum Power: Boost Your CAT 320D Performance with This Game-Changing Injector!",
    "Mesin yang handal adalah investasi jangka panjang. Dengan menggunakan Injector CAT 320D, performa mesin diesel Anda tetap terjaga dalam kondisi optimal":"A reliable engine is a long-term investment. By using the Injector CAT 320D, your diesel engine's performance remains in optimal condition",

    "14/12/2024": "Posted",
    "Rahasia Mesin Diesel Lebih Awet dan Optimal: Valve G4 Hilux 2GD Itech": "The Secret to Longer-Lasting and Optimal Diesel Engines: VALVE G4 HILUX 2GD ITECH",
    "Apakah Anda ingin mesin diesel Anda lebih awet, efisien, dan bebas dari masalah? Jika iya, jawabannya ada pada VALVE G4 HILUX 2GD ITECH": "Want your diesel engine to last longer, run efficiently, and stay trouble-free? If so, the answer lies in the VALVE G4 HILUX 2GD ITECH",

    "11/12/2024": "Posted",
    "Rahasia Mesin Diesel Tetap Bertenaga! Pilih SCV Pajero Dakar dari Indo Teknik!": "The Secret to Diesel Engines Staying Powerful! Choose SCV Pajero Dakar from Indo Teknik",
    "Saatnya upgrade Suction Control Valve (SCV) Pajero Anda dengan produk berkualitas tinggi dari INDO TEKNIK!": " It’s time to upgrade your Suction Control Valve (SCV) with a high-quality product from INDO TEKNIK!",

    "09/12/2024": "Posted",
    "Injektor Ini Bikin Ford Ranger Anda Ngebut Abis!": "This Injector Makes Your Ford Ranger Lightning Fast!",
    "Injector ini dirancang dengan komponen yang lebih sederhana, sehingga perawatannya menjadi lebih mudah dan ekonomis": "Designed with simpler components, this injector is easier and more economical to maintain",

    "07/12/2024": "Posted",
    "Turbo Charger RHV4 1515A170 ITech: Bikin Pajero Dakar Makin Ngebut dan Tangguh!": "Turbo Charger RHV4 1515A170 ITech: Makes the Pajero Dakar Even Faster and More Powerful!",
    "Dengan desain yang sederhana, Anda tidak perlu khawatir soal perawatan. Komponen turbo ini dirancang agar mudah diakses, sehingga perawatan menjadi lebih ekonomis dan efisien": "With a simple design, you don't have to worry about maintenance. The turbo components are designed to be easily accessible, making maintenance more economical and efficient",

    "05/12/2024": "Posted",
    "Upgrade Mesin Nissan FE6A? Delivery Valve 131110-6820 (A49) ITech untuk Performa Maksimal": "Nissan FE6A Engine Upgrade? Delivery Valve 131110-6820 (A49) ITech for Maximum Performance",
    "Mesin diesel Anda kurang bertenaga? Jangan khawatir! Saatnya menggunakan Delivery Valve 131110-6820 (A49) ITech. Komponen kecil ini bisa membuat mesin Nissan FE6A Anda bekerja lebih maksimal": "Is your diesel engine underpowered? Don't worry! It's time to use ITech's Delivery Valve 131110-6820 (A49). This small component can make your Nissan FE6A engine work more optimally",

    "03/12/2024": "Posted",
    "Mau Mesin Diesel Anda Makin Bertenaga! Ini Dia Kuncinya! Rotor Head 7189-039 Itech": "Want Your Diesel Engine to Be More Powerful? Here's the Secret! Rotor Head 7189-039 ITech",
    "Jika kamu mencari cara untuk meningkatkan performa mesin diesel, menjaga efisiensi bahan bakar, dan mengurangi risiko kerusakan, Rotor Head 7189-039L ITech adalah jawabannya!": "If you are looking for a way to improve diesel engine performance, maintain fuel efficiency, and reduce the risk of damage, the ITech 7189-039L Rotor Head is the answer!",

    "01/12/2024": "Posted",
    "Penggemar Mesin Diesel Wajib Tahu! Nozzle Pensil Assy Ini Jadikan Mesin Lebih Perkasa!": "Diesel Engine Enthusiasts Must Know! This Pencil Nozzle Assy Makes Your Engine More Powerful!",
    "Dengan kontrol pembakaran yang lebih baik, mesin Anda bekerja lebih optimal. Pembakaran yang sempurna memberikan tenaga yang konsisten, bahkan dalam kondisi berat sekalipun": "With better combustion control, your engine works more optimally. Perfect combustion provides consistent power, even in tough conditions",

    "29/11/2024": "Posted",
    "Injection Pump Jadi Lebih Awet? Ini Rahasianya!": "Does the Injection Pump Last Longer? This is the Secret!",
    "Salah satu penyebab utama efisiensi bahan bakar menurun adalah kebocoran pada sistem pompa. Dengan liner berkualitas tinggi, kebocoran dapat dicegah secara efektif": "One of the main causes of decreased fuel efficiency is leakage in the pump system. With high-quality liners, leakage can be prevented effectively.",

    "26/11/2024": "Posted",
    "Tanjakan Serasa Datar dengan Turbocharger Itech CT16 17201-OL070 untuk Kijang Innova 2KD": "The Incline Feels Flat With Turbocharger Itech CT16 17201-OL070 For Kijang Innova 2KD",
    "Dengan Turbocharger Itech, gas terasa lebih ringan dan responsif. Saat menekan pedal gas, tenaga langsung tersalurkan, memberikan pengalaman berkendara yang lebih dinamis": "With the Turbocharger Itech, your throttle feels lighter and more responsive. When you press the gas pedal, the power is instantly delivered, offering a dynamic driving experience",

    "23/11/2024": "Posted",
    "Kenapa Banyak yang Memilih Plunger ITech 9H5797?": "Why Do Many Choose the ITech Plunger 9H5797?",
    "Jika Anda sedang mencari solusi injeksi bahan bakar yang andal untuk mesin diesel berat, jawabannya ada di Plunger ITech 9H5797": "If you are looking for a reliable fuel injection solution for heavy-duty diesel engines, the answer lies in ITech Plunger 9H5797",

    "20/11/2024": "Posted",
    "Sistem Bahan Bakar Makin Cepat Tanggap Dengan Switch Limiter Pipa Common Rail Itech!": "Fuel System Becomes More Responsive with ITech Common Rail Pipe Switch Limiter!",
    "Sensor ini dirancang untuk memberikan pembacaan tekanan yang sangat akurat dalam sistem bahan bakar": "This sensor is engineered to provide highly accurate pressure readings within the fuel system",

    "17/11/2024": "Posted",
    "Mengapa Feed Pump Assy ITech Wajib Jadi Pilihan Anda!": "Why the ITech Feed Pump Assy Should Be Your Top Choice!",
    "Feed Pump ITech 105237-4410 memiliki keunggulan utama dalam memberikan aliran bahan bakar yang stabil, yang penting untuk pembakaran sempurna dalam mesin": "The ITech Feed Pump 105237-4410 stands out for its ability to deliver a stable fuel flow, essential for perfect combustion in the engine",

    "14/11/2024": "Posted",
    "Jaga Performa Mesinmu dengan SCV ITECH Ini! Suction Control Valve Itech 294200-4970": "The SCV Itech has undergone durability tests under extreme conditions and proven to have exceptional endurance",
    "SCV Itech telah melalui uji ketahanan dalam berbagai kondisi ekstrem dan terbukti memiliki daya tahan yang luar biasa": "The SCV Itech has undergone durability tests under extreme conditions and proven to have exceptional endurance",

    "12/11/2024": "Posted",
    "Tips Penting Saat Ganti Seal Mesin Press: Langkah Reparasi Silinder Jack Mesin Press 300 Bar yang Bocor": "Important Tips for Replacing Press Machine Seals: Steps to Repair a Leaking 300 Bar Press Machine Jack Cylinder",
    "Para mekanik kita menunjukkan proses reparasinya mulai dari penggantian seal silinder dengan bahan berkualitas tinggi dan tahan lama": "Our mechanics demonstrate the repair process, starting with replacing the cylinder seals using high-quality, durable materials",

    "10/11/2024": "Posted",
    "Proses Pembongkaran dan Pembersihan Tangki Bahan Bakar di Indo Teknik":"Fuel Tank Disassembly and Cleaning Process at Indo Teknik",
    "Tangki bahan bakar pada mobil, terutama diesel, sangat rentan menimbun kotoran, karat, dan bahkan lumut": "Fuel tanks in vehicles, especially diesel ones, are highly prone to accumulating dirt, rust, and even algae",
    
    "09/11/2024": "Posted",
    "Pentingnya Perbaikan Tepat pada Silinder Bucket PC-130 untuk Kinerja Alat Berat yang Optimal": "The Importance of Proper Repair of the PC-130 Bucket Cylinder for Optimal Heavy Equipment Performance",
    "Jika Anda menghadapi masalah kebocoran pada seal silinder bucket PC-130, segera perhatikan dan atasi sebelum kerusakan semakin parah!":"If you are dealing with leakage in the seal of the PC-130 bucket cylinder, address it immediately before the damage worsens!",

    "6/11/2024": "Posted",
    "Tips Penting dalam Reparasi Bucket Ekskavator untuk Menghemat Biaya Operasional":"Important Tips for Excavator Bucket Repair to Save Operational Costs",
    "Setiap bucket ekskavator dibuat dari bahan yang berbeda, dan pemilihan kawat las harus disesuaikan dengan bahan tersebut":"Each excavator bucket is made from different materials, and the selection of welding wire should be tailored to these materials",
    
    "3/11/2024": "Posted",
    "Review Nozzle P1030 Itech untuk Pajero Dakar 2.5: Pilihan Terbaik untuk Performa Maksimal":"Review of Nozzle P1030 ITech for Pajero Dakar 2.5: The Best Choice for Maximum Performance",
    "Nozzle P1030 ITech adalah salah satu komponen yang sering dicari oleh para pemilik Pajero Dakar 2.5":"The Nozzle P1030 ITech is a highly sought-after component among Pajero Dakar 2.5",
    
    "1/11/2024": "Posted",
    "Ini Dia!!! Solusi Ampuh untuk Canter Anda: Plunger Supply Pump Euro 4 FE 7.8":"Here It Is!!! The Ultimate Solution for Your Canter: Plunger Supply Pump Euro 4 FE 7.8",
    "Apakah Anda pemilik Canter Euro 4 FE 7.8? Jika iya, Anda pasti menginginkan kendaraan yang selalu dalam kondisi prima, kuat, dan efisien":"Are you the proud owner of a Canter Euro 4 FE 7.8? If so, you undoubtedly want your vehicle to remain in top condition—powerful, efficient, and reliable",
    
    "30/10/2024": "Posted",
    "Service Injection Pump Colt Diesel di Pekanbaru - Indo Teknik":"Service Injection Pump Colt Diesel in Pekanbaru - Indo Teknik",
    "Ketika kalian service Injection Pump di Indo Teknik, kami tidak hanya membongkar bagian atas atau sebagian saja, tapi membongkar seluruh komponen":"When you service your Injection Pump at Indo Teknik, we don't just disassemble the top or part of it; we dismantle all the components",
    
    "27/10/2024": "Posted",
    "Proses Pembongkaran Pump Rotary Isuzu Elf Pekanbaru: Tips Aman dan Detail":"Service Injection Pump Colt Diesel in Pekanbaru - Indo Teknik",
    "Sebelum mulai, ada beberapa hal penting yang harus diperhatikan saat membongkar Pump Rotary":"Before starting, there are several important points to keep in mind when disassembling the Rotary Pump",

    "24/10/2024": "Posted",
    "Service Injection Pump Hino Lohan Pekanbaru: Kinerja Optimal":"Service Injection Pump for Hino Lohan in Pekanbaru: Optimal Performance",
    "Pertama-tama, kita mulai dengan membongkar injection pump dari truk Hino Lohan ini":"We begin by removing the injection pump from the Hino Lohan truck",

    "20/10/2024": "Posted",
    "Ganti Rotor Head di Indo Teknik Pekanbaru, Kantong Aman dan Hasil Terjamin!":"Replace the Rotor Head at Indo Teknik Pekanbaru: Affordable and Guaranteed Results!",
    "Ketika pump Isuzu ini dibongkar dan dicek, ternyata as rotornya sudah aus dan wajib diganti":"When the Isuzu pump was disassembled and inspected, it turned out the rotor shaft was worn and needed replacement",
    
    "17/10/2024": "Posted",
    "Mengatasi Masalah Injector Mobil: Pentingnya Menggunakan Sparepart yang Sesuai Standar":"Overcoming Car Injector Problems: The Importance of Using Standard-Compliant Spare Parts",
    "Di Indo Teknik Pekanbaru, kami memiliki pengalaman luas dalam menangani Electronic Unit Injector Caterpillar C9":"At Indo Teknik Pekanbaru, we have extensive experience in handling Caterpillar C9 Electronic Unit Injectors",
    
    "14/10/2024": "Posted",
    "Servis dan Kalibrasi Injektor Caterpillar C9 di Pekanbaru - Indo Teknik":"Service and Calibration of Caterpillar C9 Injectors in Pekanbaru - Indo Teknik",
    "Banyak pelanggan mengeluhkan bahwa servis injektor mobil mereka tidak tahan lama dan performanya kurang memuaskan":"Banyak pelanggan mengeluhkan bahwa servis injektor mobil mereka tidak tahan lama dan performanya kurang memuaskan",
    
    "10/10/2024": "Posted",
    "Perbaikan Injector Mitsubishi L300 di Pekanbaru: Part II - Pencucian Tangki dan Pemasangan Injektor":"Mitsubishi L300 Injector Repair in Pekanbaru: Part II - Tank Cleaning and Injector Installation",
    "Setelah membongkar injektor, langkah selanjutnya adalah memeriksa tangki bahan bakar":"After removing the injectors, the next step is to inspect the fuel tank.",

    "07/10/2024": "Posted",
    "Perbaikan Injector Mitsubishi L300 di Pekanbaru: Solusi untuk Masalah Tenaga dan Emisi":"Mitsubishi L300 Injector Repair in Pekanbaru: Part II - Tank Cleaning and Injector Installation",
    "Setelah menerima mobil, langkah pertama kami adalah melakukan pengecekan di mesin tes":"After removing the injectors, the next step is to inspect the fuel tank.",

    "_blog sidebar": "Blog Sidebar",
    "Post Terbaru": "Latest Post",
    "Kategori": "Categories",

    "_share this post": "Share This Post",
    "Berbagi postingan ini:": "Share This Post",

    "_button back": "Button Back",
    "Kembali": "Go Back"
}
